---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength
source: html/16e7a666-5c76-f327-aa57-aac5e9c3c35b.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength

An arc-length constraint associated with an arc in a RebarShapeDefinition.

## Syntax (C#)
```csharp
public class RebarShapeConstraintArcLength : RebarShapeConstraint
```